# --- 全局板块黑名单配置 ---
# 只要在这里修改，所有脚本都会同步更新
SECTOR_BLACKLIST = [
    "融资融券", "沪股通", "深股通", "MSCI", "标准普尔", "富时罗素", "央国企改革", "中证", "上证", 
    "昨日", "小盘", "大盘", "权重", "两融", "证金", "汇金", "基金重仓", "预盈预增", "标普", 
    "深证", "创业板", "科创板", "活跃", "高振幅", "昨日涨停", "转债", "破净", "机构重仓", 
    "股权转让", "中盘股", "深成500", "最近多板", "东方财富", "年报预增", "电子", "HS300",
    "创业成份", "专精特新", "2025", "华为概念", "2026", "小米概念", "百日新高", "近期新高", 
    "参股新三板", "中俄贸易概念", "中特估", "2026—季报预减", "长江三角", "2026—季报预增", 
    "参股银行", "央视50_", "股权激励", "中字头", "QFII重仓", "中盘价值", "价值股", "近期新高", 
    "中盘成长", "百元股", "年报预增", "HS300", "中特估", "历史新高", "专精特新", "AH股", "阿里概念", 
    "深圳特区", "一带一路", "公用事业", "低价股" , "IPO受益" , "AB股" , "上海自贸" , "乡村振兴" , 
    "京津冀", "周期股", "微盘股", "其他专用设备", "养老金", "地摊经济", "其他电源设备Ⅱ", "其他电源设备Ⅲ", 
    "行业龙头", "西部大开发", "微利股", "复合集流体", "味蕾经济", "独角兽", "次新股","破发股","旅游零售Ⅲ",
    "旅游零售Ⅱ", "IT服务Ⅲ", "破增发价股", "参股券商", "贬值受益", "成渝特区"
]

# 你也可以把数据库配置放进来，方便以后修改密码
DB_CONFIG = {
    'host': 'localhost',
    'port': 3306,
    'user': 'root',
    'password': 'root_secret_2026',
    'db_quant': 'quant_db',
    'db_review': 'trading_review'
}